ps-aug19-2017/documentation.org
#+TITLE: Policy Study Documentation
#+AUTHOR: Matthew Jaffee

* Overview
This is an application for studying how users read and interpret
password policies. It tracks users, allowing new users to be created,
and old users to sign in.

The purpose of the application is to have users complete a
set of questions about a password policy using information in a
password policy description document. Each user is assigned several
password policies and is asked to complete the same questionnaire for
each policy.

When the questionnaire is complete, statements of a BNF grammar are
generated which formally describe the password policy.

Most aspects of the applications behavior are configurable - there is
an administrative interface which allows several parameters to be
changed, such as the number of policies assigned to each user, and email
addresses which comments are sent to. It is also possible to add and
remove admin accounts, and change their passwords.

Other administrative functionality includes viewing raw database
information and testing the policy questionnaire.


** Dependencies
The policy study is a Flask application http://flask.pocoo.org/. It makes use
of the Jinja2 templating engine http://jinja.pocoo.org/docs/ for html
templates, and MongoDB http://www.mongodb.org/ for a
datastore. Pymongo http://api.mongodb.org/python/2.7rc0/ is used for
communicating with MongoDB.

On start up, the policy study reads in an XML file (specified in
config.py) and uses xmltodict https://github.com/martinblech/xmltodict
to convert the XML to a Python dictionary for internal manipulation.

** Datastore
There are currently 4 'collections' in the database. Their formats look like the following:

*** user
#+BEGIN_SRC python
{
"isadmin": boolean,
"date_created": isoformat date,
"done_demographic_survey: boolean,
"name": string,
"hash_name": string describing hash func for username if not admin and pass if admin,
"password_hash": string,
"policies": list of policies for this user,
"demographic_survey": {"field": "value, ....},
}
#+END_SRC

*** config
#+BEGIN_SRC python
{
"policies_per_user": int,
"comments_emails": list
"policies": list [["title", "file"], ["title2", "file"]],
"policies_used": {"title": int, "title2": int },
"policy_filenames": {"AMES": "ames.pdf", "Amazon": "amazon.pdf", ...}
}
#+END_SRC

*** questionnaire
#+BEGIN_SRC python
{
"username": string,
"policy_name": string,
"date_created": isoformat date,
"state": string ["new"|"draft"|"completed"]
"questions": {
  "1": "1.A", (select one question)
  "20.1": ["20.1.A", 20.1.G"], (select multi question)
  "13.1.A.a": 22, (numerical cloze question)
  "13.1.B.c": "second(s)", (select one cloze / memo / text)
}
}
#+END_SRC

*** logs
#+BEGIN_SRC python
{u'bnf_version': u'kevinV1',
 u'policy_name': None,
 u'xmlversion': "1.2.3",
 u'app_version': "0.1.1",
 u'qaversion': u'30oct2013v1',
 u'timestamp': 1395435599.534258,
 u'type': u'http',
 u'user_agent_browser': u'chrome',
 u'user_agent_language': None,
 u'user_agent_os': u'linux',
 u'user_agent_version': u'32.0.1700.123',
 u'user_type': u'participant',
 u'user_id': u'fk3jlk2j3kflkwjefiuiouslkdfjlkasjfdlkjk32lk3j4lk3kljiouo398009vlkjs9e809234jpzj',
 u'url': 'http://localhost:5000/policies',
 u'context': { "question:q.1.1clone2", "response:q.1.1.Aclone2" }p
}
#+END_SRC


** Report Formats
Reporting scripts (described below) pull information from the database and report it in several formats.

*** CSV reports
The CSV reports take data from the 'logs' collection in the
datastore. The keys from the log document are used as the header line
in the CSV file, and the values from each log document make up each
row in the file. The one exception is the context key which itself
contains an object full of key/value pairs. This object is expanded
into the rightmost columns and each cell will contain key: value. For
BNF events, one cell will contain the key "new" followed by a list of
all the BNF statements, and the next cell will contain "old" followed
by a list of all the BNF statements just before the latest change.

Example - The "logs" object above from the datastore documentation
would become:
#+begin_src csv
xmlversion, qaversion, bnf_version, app_version, timestamp, policy_name, user_agent_os, user_agent_browser, user_agent_version, user_agent_language, user_type, type, user_id, url
1.2.3, 30oct2013v1, kevinV1, 0.1.1, 1395435599.534258, None, linux, chrome, 32.0.1700.123, None, participant, fk3jlk2j3kflkwjefiuiouslkdfjlkasjfdlkjk32lk3j4lk3kljiouo398009vlkjs9e809234jpzj,  http://localhost:5000/policies, question:q.1.1clone2, response:q.1.1.Aclone2
#+end_src

*** R files
R files generated by the =report.py= script contain the BNF
statements for a particular questionnaire, and the corresponding
questionnaire object from the data store in comments.

