ps-aug19-2017/documentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Policy Study Documentation</title>
<!-- 2014-12-02 Tue 17:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Matthew Jaffee" />
</head>
<body>
<div id="content">
<h1 class="title">Policy Study Documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Overview</a>
<ul>
<li><a href="#sec-1-1">1.1. Dependencies</a></li>
<li><a href="#sec-1-2">1.2. Datastore</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. user</a></li>
<li><a href="#sec-1-2-2">1.2.2. config</a></li>
<li><a href="#sec-1-2-3">1.2.3. questionnaire</a></li>
<li><a href="#sec-1-2-4">1.2.4. logs</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Report Formats</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. CSV reports</a></li>
<li><a href="#sec-1-3-2">1.3.2. R files</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Logging</a></li>
<li><a href="#sec-1-5">1.5. Overall instruction flow</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. questionnaire</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6. Notable Behaviors</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1. Demographics and General Comments</a></li>
<li><a href="#sec-1-6-2">1.6.2. Questionnaire</a></li>
<li><a href="#sec-1-6-3">1.6.3. Input file</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Scripts</a>
<ul>
<li><a href="#sec-2-1">2.1. report.py</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. BNF</a></li>
<li><a href="#sec-2-1-2">2.1.2. Report</a></li>
<li><a href="#sec-2-1-3">2.1.3. Report per</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. store\<sub>admin</sub>.py</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. cp</a></li>
<li><a href="#sec-2-2-2">2.2.2. rm</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. mongodump</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Tests</a></li>
<li><a href="#sec-4">4. File Layout</a>
<ul>
<li><a href="#sec-4-1">4.1. setup.py</a></li>
<li><a href="#sec-4-2">4.2. runserver.py</a></li>
<li><a href="#sec-4-3">4.3. policy\<sub>study</sub>/</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1. *.py files</a></li>
<li><a href="#sec-4-3-2">4.3.2. test\<sub>*</sub>.py files</a></li>
<li><a href="#sec-4-3-3">4.3.3. templates</a></li>
<li><a href="#sec-4-3-4">4.3.4. static</a></li>
</ul>
</li>
<li><a href="#sec-4-4">4.4. documented-input.xml</a></li>
<li><a href="#sec-4-5">4.5. resources</a>
<ul>
<li><a href="#sec-4-5-1">4.5.1. policies.txt</a></li>
<li><a href="#sec-4-5-2">4.5.2. polices</a></li>
</ul>
</li>
<li><a href="#sec-4-6">4.6. Input XML file</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Moving to production</a>
<ul>
<li><a href="#sec-5-1">5.1. Installing and configuring production application</a></li>
<li><a href="#sec-5-2">5.2. Updating Production Code Base</a>
<ul>
<li><a href="#sec-5-2-1">5.2.1. Pull down the code</a></li>
<li><a href="#sec-5-2-2">5.2.2. It may be necessary to restart uwsgi - depending on the code change</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-6">6. Running Multiple Instances for Testing purposes</a>
<ul>
<li><a href="#sec-6-1">6.1. Instructions</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1. Check out a fresh copy of the codebase.</a></li>
<li><a href="#sec-6-1-2">6.1.2. Edit runserver.py</a></li>
<li><a href="#sec-6-1-3">6.1.3. Edit <code>policy_study/config.py</code></a></li>
<li><a href="#sec-6-1-4">6.1.4. Start it up as usual</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
This is an application for studying how users read and interpret
password policies. It tracks users, allowing new users to be created,
and old users to sign in.
</p>

<p>
The purpose of the application is to have users complete a
set of questions about a password policy using information in a
password policy description document. Each user is assigned several
password policies and is asked to complete the same questionnaire for
each policy.
</p>

<p>
When the questionnaire is complete, statements of a BNF grammar are
generated which formally describe the password policy.
</p>

<p>
Most aspects of the applications behavior are configurable - there is
an administrative interface which allows several parameters to be
changed, such as the number of policies assigned to each user, and email
addresses which comments are sent to. It is also possible to add and
remove admin accounts, and change their passwords.
</p>

<p>
Other administrative functionality includes viewing raw database
information and testing the policy questionnaire.
</p>
</div>


<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Dependencies</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The policy study is a Flask application <a href="http://flask.pocoo.org/">http://flask.pocoo.org/</a>. It makes use
of the Jinja2 templating engine <a href="http://jinja.pocoo.org/docs/">http://jinja.pocoo.org/docs/</a> for html
templates, and MongoDB <a href="http://www.mongodb.org/">http://www.mongodb.org/</a> for a
datastore. Pymongo <a href="http://api.mongodb.org/python/2.7rc0/">http://api.mongodb.org/python/2.7rc0/</a> is used for
communicating with MongoDB.
</p>

<p>
On start up, the policy study reads in an XML file (specified in
config.py) and uses xmltodict <a href="https://github.com/martinblech/xmltodict">https://github.com/martinblech/xmltodict</a>
to convert the XML to a Python dictionary for internal manipulation.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Datastore</h3>
<div class="outline-text-3" id="text-1-2">
<p>
There are currently 4 'collections' in the database. Their formats look like the following:
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> user</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-python">{
"isadmin": boolean,
"date_created": isoformat date,
"done_demographic_survey: boolean,
"name": string,
"hash_name": string describing hash func for username if not admin and pass if admin,
"password_hash": string,
"policies": list of policies for this user,
"demographic_survey": {"field": "value, ....},
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> config</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">

<pre class="src src-python">{
"policies_per_user": int,
"comments_emails": list
"policies": list [["title", "file"], ["title2", "file"]],
"policies_used": {"title": int, "title2": int },
"policy_filenames": {"AMES": "ames.pdf", "Amazon": "amazon.pdf", ...}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> questionnaire</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">

<pre class="src src-python">{
"username": string,
"policy_name": string,
"date_created": isoformat date,
"state": string ["new"|"draft"|"completed"]
"questions": {
  "1": "1.A", (select one question)
  "20.1": ["20.1.A", 20.1.G"], (select multi question)
  "13.1.A.a": 22, (numerical cloze question)
  "13.1.B.c": "second(s)", (select one cloze / memo / text)
}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> logs</h4>
<div class="outline-text-4" id="text-1-2-4">
<div class="org-src-container">

<pre class="src src-python">{u'bnf_version': u'kevinV1',
 u'policy_name': None,
 u'xmlversion': "1.2.3",
 u'app_version': "0.1.1",
 u'qaversion': u'30oct2013v1',
 u'timestamp': 1395435599.534258,
 u'type': u'http',
 u'user_agent_browser': u'chrome',
 u'user_agent_language': None,
 u'user_agent_os': u'linux',
 u'user_agent_version': u'32.0.1700.123',
 u'user_type': u'participant',
 u'user_id': u'fk3jlk2j3kflkwjefiuiouslkdfjlkasjfdlkjk32lk3j4lk3kljiouo398009vlkjs9e809234jpzj',
 u'url': 'http://localhost:5000/policies',
 u'context': { "question:q.1.1clone2", "response:q.1.1.Aclone2" }p
}
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Report Formats</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Reporting scripts (described below) pull information from the database and report it in several formats.
</p>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> CSV reports</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
The CSV reports take data from the 'logs' collection in the
datastore. The keys from the log document are used as the header line
in the CSV file, and the values from each log document make up each
row in the file. The one exception is the context key which itself
contains an object full of key/value pairs. This object is expanded
into the rightmost columns and each cell will contain key: value. For
BNF events, one cell will contain the key "new" followed by a list of
all the BNF statements, and the next cell will contain "old" followed
by a list of all the BNF statements just before the latest change.
</p>

<p>
Example - The "logs" object above from the datastore documentation
would become:
</p>
<div class="org-src-container">

<pre class="src src-csv">xmlversion, qaversion, bnf_version, app_version, timestamp, policy_name, user_agent_os, user_agent_browser, user_agent_version, user_agent_language, user_type, type, user_id, url
1.2.3, 30oct2013v1, kevinV1, 0.1.1, 1395435599.534258, None, linux, chrome, 32.0.1700.123, None, participant, fk3jlk2j3kflkwjefiuiouslkdfjlkasjfdlkjk32lk3j4lk3kljiouo398009vlkjs9e809234jpzj,  http://localhost:5000/policies, question:q.1.1clone2, response:q.1.1.Aclone2
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> R files</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
R files generated by the <code>report.py</code> script contain the BNF
statements for a particular questionnaire, and the corresponding
questionnaire object from the data store in comments.
</p>
</div>
</div>
</div>
