ps-aug19-2017/documentation.org
** Logging
There are seven different types of logs: http, comment, response, bnf,
login, signup, and logout. They all carry the same metadata fields
described under datastore and report formats, but the context fields
may differ.

- response: has "question" and "response" context fields
- bnf: has "new" and "old" which contain lists of the current set of
  bnf statements and the previous set of bnf statements respectively
- comment: has all of the fields in the comment form as context
- http, login, signup, logout: login, signup and logout are just
  special cases of http logging which has no context



** Overall instruction flow
On application start up, =runserver.py= calls =views.initialize=. The
=initialize= function drives the functions in =elements.py=, loading the XML
file, parsing it, and preparing it for use by the application. When
this is complete, =runserver.py= calls =app.run= which starts the
webserver, and then the application is listening for requests from
user's web browsers.

When a user requests a page, the request is routed to a particular
function in =views.py= based on the =@app.route= decorators that you will
see above many of the functions. Many of the functions also have an
=@login_required= or =@admin_required= decorator which ensure that a user
is logged in before displaying that page, or is an admin respectively.

Once a request is routed, the logic in the view function
executes. Most functions end with something like =return
render_template('page.html', extradata=extradata)= This finds the
=page.html= template file (under the =templates/= subdirectory) and
potentially passes some extra data to it which jinja will use to fill
out values in the template and return an actual html page to the
user. Aside from templates, flask will also serve files from the
=static/= subdirectory, which consists of CSS, Javascript, and the PDFs
of password policies.

*** questionnaire
The most complex view/template is the policy questionnaire. Because
of it's highly dynamic and configurable nature, the questionnaire
page is set up as a single view and template which is flexible enough
to display any "page" of the questionnaire.

=elements.py= pre-processes the XML file to get it into a format which
is easily usable by the =questionnaire_page= template. The template
consists of a series of Jinja macros which call eachother to render
all the main parts of the page.


** Notable Behaviors
The application as a whole is dependent upon javascript and pop-ups
being enabled in the user's browser. There are checks for these on
most pages. The javascript check works using a noscript tag to warn
the user if javascript is disabled. The popup check works by trying to
create a popup and then showing a warning if the creation failed. If
the creation is successful, the popup is immediately closed, although
a user might see it flicker onto their screen briefly.

*** Demographics and General Comments
The demographic survey and general comments pages have sections in the
input file which allow their questions to be flexibly defined, just as
in the questionnaire. There are however, a few differences:
1. They do not have an index, because they are single page
   questionnaires. The questions defined in their respective sections
   will be rendered in the order they are written in the input file.
2. Additionally, cloning is not supported in the demographics survey,
   or on the general comments page.
3. Using "insert" in questions on the general comments page is also
   not supported since there might not be a user logged in to save
   inserted answers as.

*** Questionnaire
1. A given question should only be cloned from one location.
2. When an answer to a question which generates clones is changed such
   that the new answer does not generate a clone that the old answer
   did, a warning is popped up prompting the user to confirm the
   action. If the user confirms the action, the generated clones will
   be removed, along with any clones which depended on their answers,
   and so on down the chain of dependency.
3. For any option which triggers a question to be displayed due to a
   =display_when= attribute, any cloned question which contains that
   option will also cause the question to be displayed.

*** Input file
1. Tags which are present but have no text will cause an empty string
   to be used as the value unless otherwise noted. (i.e. "leave blank
   to disable")
2. If a =BNF_mapping= tag has a "when" attribute, all options in the
   comma separated list must be selected for the statement to be
   generated. As a debugging tool, the statement will be generated
   when any of the options are selected, but if not all are selected,
   the string "INCOMPLETE BNF (missing options)" will be prepended to
   the BNF statement.
3. If a particular tag is left completely empty, it is by default
   given a value of =None=. This is not very convenient for this
   application, and so there is a way built in to automatically
   convert all =None= values in the input file to something else. In
   =config.py=, you will find the parameter CONVERT_NONE_TO, which you
   can set equal to an empty string (the default), or any other string
   you like for debugging purposes.



* Scripts
The application comes with a set of scripts for generating reports,
backing up the data store - switching to a clean datastore, etc.

Call scripts by executing =python policy_study/script_name.py=
followed by whatever commands and options are necessary. Almost all
modes of all scripts may take an optional argument of
--dbname=<dbname>, the name of the mongo database to operate on. The
default database name is "policydb".

** report.py
The report script has multiple modes.

*** BNF
=bnf [options] <outputdir>=

Writes a file per questionnaire to the output directory which contains the bnf statements for that questionnaire.
*** Report
=[options] <outfile>=

Writes a single file which contains all collected log data in CSV format

*** Report per
=[options] <field> <outputdir>=

Writes one file per unique value of =field= name to the outputdir
containing the logs which have that field equal to that value. Writes
logs which do not have that field to a file named =None=.
*** Extra
=[options] extra <outfile>=

Writes a csv file with the following header
#+begin_src txt
"object_id", "username", "policy_name", "state", "date_completed", "BNF statement"
#+end_src
one line per BNF statement in the data store.

** =store_admin.py=
The store administration script has 2 modes.
*** cp
=cp [options] <target_name>=

Copy the given dbname, or the default database to a new name - potentially to save for later reports.

