ps-aug19-2017/documentation.html

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Logging</h3>
<div class="outline-text-3" id="text-1-4">
<p>
There are seven different types of logs: http, comment, response, bnf,
login, signup, and logout. They all carry the same metadata fields
described under datastore and report formats, but the context fields
may differ.
</p>

<ul class="org-ul">
<li>response: has "question" and "response" context fields
</li>
<li>bnf: has "new" and "old" which contain lists of the current set of
bnf statements and the previous set of bnf statements respectively
</li>
<li>comment: has all of the fields in the comment form as context
</li>
<li>http, login, signup, logout: login, signup and logout are just
special cases of http logging which has no context
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Overall instruction flow</h3>
<div class="outline-text-3" id="text-1-5">
<p>
On application start up, <code>runserver.py</code> calls <code>views.initialize</code>. The
<code>initialize</code> function drives the functions in <code>elements.py</code>, loading the XML
file, parsing it, and preparing it for use by the application. When
this is complete, <code>runserver.py</code> calls <code>app.run</code> which starts the
webserver, and then the application is listening for requests from
user's web browsers.
</p>

<p>
When a user requests a page, the request is routed to a particular
function in <code>views.py</code> based on the <code>@app.route</code> decorators that you will
see above many of the functions. Many of the functions also have an
<code>@login_required</code> or <code>@admin_required</code> decorator which ensure that a user
is logged in before displaying that page, or is an admin respectively.
</p>

<p>
Once a request is routed, the logic in the view function
executes. Most functions end with something like <code>return
render_template('page.html', extradata=extradata)</code> This finds the
<code>page.html</code> template file (under the <code>templates/</code> subdirectory) and
potentially passes some extra data to it which jinja will use to fill
out values in the template and return an actual html page to the
user. Aside from templates, flask will also serve files from the
<code>static/</code> subdirectory, which consists of CSS, Javascript, and the PDFs
of password policies.
</p>
</div>

<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> questionnaire</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
The most complex view/template is the policy questionnaire. Because
of it's highly dynamic and configurable nature, the questionnaire
page is set up as a single view and template which is flexible enough
to display any "page" of the questionnaire.
</p>

<p>
<code>elements.py</code> pre-processes the XML file to get it into a format which
is easily usable by the <code>questionnaire_page</code> template. The template
consists of a series of Jinja macros which call eachother to render
all the main parts of the page.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Notable Behaviors</h3>
<div class="outline-text-3" id="text-1-6">
<p>
The application as a whole is dependent upon javascript and pop-ups
being enabled in the user's browser. There are checks for these on
most pages. The javascript check works using a noscript tag to warn
the user if javascript is disabled. The popup check works by trying to
create a popup and then showing a warning if the creation failed. If
the creation is successful, the popup is immediately closed, although
a user might see it flicker onto their screen briefly.
</p>
</div>

<div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> Demographics and General Comments</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
The demographic survey and general comments pages have sections in the
input file which allow their questions to be flexibly defined, just as
in the questionnaire. There are however, a few differences:
</p>
<ol class="org-ol">
<li>They do not have an index, because they are single page
questionnaires. The questions defined in their respective sections
will be rendered in the order they are written in the input file.
</li>
<li>Additionally, cloning is not supported in the demographics survey,
or on the general comments page.
</li>
<li>Using "insert" in questions on the general comments page is also
not supported since there might not be a user logged in to save
inserted answers as.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> Questionnaire</h4>
<div class="outline-text-4" id="text-1-6-2">
<ol class="org-ol">
<li>A given question should only be cloned from one location.
</li>
<li>When an answer to a question which generates clones is changed such
that the new answer does not generate a clone that the old answer
did, a warning is popped up prompting the user to confirm the
action. If the user confirms the action, the generated clones will
be removed, along with any clones which depended on their answers,
and so on down the chain of dependency.
</li>
<li>For any option which triggers a question to be displayed due to a
<code>display_when</code> attribute, any cloned question which contains that
option will also cause the question to be displayed.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-6-3" class="outline-4">
<h4 id="sec-1-6-3"><span class="section-number-4">1.6.3</span> Input file</h4>
<div class="outline-text-4" id="text-1-6-3">
<ol class="org-ol">
<li>Tags which are present but have no text will cause an empty string
to be used as the value unless otherwise noted. (i.e. "leave blank
to disable")
</li>
<li>If a <code>BNF_mapping</code> tag has a "when" attribute, all options in the
comma separated list must be selected for the statement to be
generated. As a debugging tool, the statement will be generated
when any of the options are selected, but if not all are selected,
the string "INCOMPLETE BNF (missing options)" will be prepended to
the BNF statement.
</li>
</ol>
</div>
</div>
</div>
</div>




<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Scripts</h2>
<div class="outline-text-2" id="text-2">
<p>
The application comes with a set of scripts for generating reports,
backing up the data store - switching to a clean datastore, etc.
</p>

<p>
Call scripts by executing <code>python policy_study/script_name.py</code>
followed by whatever commands and options are necessary. Almost all
modes of all scripts may take an optional argument of
&#x2013;dbname=&lt;dbname&gt;, the name of the mongo database to operate on. The
default database name is "policydb".
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> report.py</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The report script has 3 modes.
</p>
</div>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> BNF</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
<code>bnf [options] &lt;outputdir&gt;</code>
</p>

<p>
Writes a file per questionnaire to the output directory which contains the bnf statements for that questionnaire.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Report</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
<code>[options] &lt;outfile&gt;</code>
</p>

<p>
Writes a single file which contains all collected log data in CSV format
</p>
</div>
</div>

<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Report per</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
<code>[options] &lt;field&gt; &lt;outputdir&gt;</code>
</p>

<p>
Writes one file per unique value of <code>field</code> name to the outputdir
containing the logs which have that field equal to that value. Writes
logs which do not have that field to a file named <code>None</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> store\<sub>admin</sub>.py</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The store administration script has 2 modes.
</p>
</div>
<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> cp</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
<code>cp [options] &lt;target_name&gt;</code>
</p>

<p>
Copy the given dbname, or the default database to a new name - potentially to save for later reports.
</p>
</div>
</div>
