ps-aug19-2017/documentation.org
*** rm
=rm <db_to_remove>=

Drop the named database. Dropping policydb will reset the application to a clean slate.

** mongodump
Mongodump is a script that comes with MongoDB. You should be able to
run it simply by typing 'mongodump'. It will write the contents of
whatever database it is given to disk. Options for controlling it are
available by executing =mongodump --help=.

* Tests

Tests can be found in the =test_*.py= files. Tests use the py.test
framework and can be run by changing to the =policy_study= directory
and running py.test like so:
#+BEGIN_SRC bash
$ cd policy_study
$ py.test
================================================ test session starts =================================================
platform linux2 -- Python 2.7.7 -- py-1.4.20 -- pytest-2.5.2
collected 32 items

test_bnf.py ....
test_clones.py .....
test_elements.py ..........
test_tree.py ..
test_utils.py .......
test_validation.py ....

============================================= 32 passed in 0.99 seconds =============================================
#+END_SRC
Tests for a given module are in =test_MODULENAME.py=.
* File Layout
** setup.py
Project file for python setuptools. Running =python setup.py install=
will download all necessary dependencies to run the application.

** runserver.py
Running =python runserver.py= starts a lightweight development server for testing the application.

** policy\_study/
The policy\_study directory contains application code and tests.

*** *.py files
All of the =.py= files that don't start with test_ are python
application code.

*** test\_*.py files
Files containing tests which are named after the file they are
testing. i.e. =test_utils.py= contains tests for functions in
=utils.py=.

*** templates
The templates directory contains =.html= files which are actually
Jinja2 templates. Each of these files corresponds to a page in the
policy except for =common.html= which contains common elements which
most of the other pages inherit, and =macros.html= which contains
Jinja2 macros that the other template files can use.

*** static
The static directory contains files which the webserver will need to
access to serve directly. This includes stylesheets (CSS),
Javascript, images/icons, and fonts. All CSS written for the
application is in =style.css=. The majority of the javascript is in
=questionnaire.js=, although there are a few page specific pieces in
=demosurvey_page.js=, =general_comments_page.js=, and
=questionnaire_page.js=. All other =.js= and =.css= files are
libraries which were pulled in from outside sources.

** documented-input.xml
This is an annotated version of the input xml file which explains what each element is used for.

** resources
The resources directory contains a number of non-code files used by
the application.

*** policies.txt
A text file of the format:
#+BEGIN_SRC txt
Policy Name|filename.pdf
Policy Name2|filename2.pdf
#+END_SRC
Where =Policy Name= is the title which will be given to the policy in
the application, and filename.pdf is the name of the file to take
from the =policies= directory (also under =resources=).

Each user has a list of the titles associated with them. A persistent
mapping from title to filename is stored in the "config" collection in
the database. When you change a title, a new entry gets added to the
mapping with the new title and the old filename - The old title will
continue working as it did before. If you change the filename
associated with a particular title, then any user who has that title
will now be served the new filename.

To be more succint:
Changing a title adds to the title:filename mapping, whereas changing
a filename changes the mapping.

*** polices
Contains policy pdfs, which are specified in policies.txt.


** Input XML file
The input xml file (which, at the time of this writing, is set to
=pp_test.xml= in =policy_study/config.py=. See =documented-input.xml=
for more information.
* Moving to production
