ps-aug19-2017/documentation.html

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> rm</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
<code>rm &lt;db_to_remove&gt;</code>
</p>

<p>
Drop the named database. Dropping policydb will reset the application to a clean slate.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> mongodump</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Mongodump is a script that comes with MongoDB. You should be able to
run it simply by typing 'mongodump'. It will write the contents of
whatever database it is given to disk. Options for controlling it are
available by executing <code>mongodump --help</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Tests</h2>
<div class="outline-text-2" id="text-3">
<p>
Tests can be found in the <code>test_*.py</code> files. Tests use the py.test
framework and can be run by changing to the <code>policy_study</code> directory
and running py.test like so:
</p>
<div class="org-src-container">

<pre class="src src-bash">$ cd policy_study
$ py.test
================================================ test session starts =================================================
platform linux2 -- Python 2.7.7 -- py-1.4.20 -- pytest-2.5.2
collected 32 items

test_bnf.py ....
test_clones.py .....
test_elements.py ..........
test_tree.py ..
test_utils.py .......
test_validation.py ....

============================================= 32 passed in 0.99 seconds =============================================
</pre>
</div>
<p>
Tests for a given module are in <code>test_MODULENAME.py</code>.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> File Layout</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> setup.py</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Project file for python setuptools. Running <code>python setup.py install</code>
will download all necessary dependencies to run the application.
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> runserver.py</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Running <code>python runserver.py</code> starts a lightweight development server for testing the application.
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> policy\<sub>study</sub>/</h3>
<div class="outline-text-3" id="text-4-3">
<p>
The policy\<sub>study</sub> directory contains application code and tests.
</p>
</div>

<div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> *.py files</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
All of the <code>.py</code> files that don't start with test_ are python
application code.
</p>
</div>
</div>

<div id="outline-container-sec-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> test\<sub>*</sub>.py files</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
Files containing tests which are named after the file they are
testing. i.e. <code>test_utils.py</code> contains tests for functions in
<code>utils.py</code>.
</p>
</div>
</div>

<div id="outline-container-sec-4-3-3" class="outline-4">
<h4 id="sec-4-3-3"><span class="section-number-4">4.3.3</span> templates</h4>
<div class="outline-text-4" id="text-4-3-3">
<p>
The templates directory contains <code>.html</code> files which are actually
Jinja2 templates. Each of these files corresponds to a page in the
policy except for <code>common.html</code> which contains common elements which
most of the other pages inherit, and <code>macros.html</code> which contains
Jinja2 macros that the other template files can use.
</p>
</div>
</div>

<div id="outline-container-sec-4-3-4" class="outline-4">
<h4 id="sec-4-3-4"><span class="section-number-4">4.3.4</span> static</h4>
<div class="outline-text-4" id="text-4-3-4">
<p>
The static directory contains files which the webserver will need to
access to serve directly. This includes stylesheets (CSS),
Javascript, images/icons, and fonts. All CSS written for the
application is in <code>style.css</code>. The majority of the javascript is in
<code>questionnaire.js</code>, although there are a few page specific pieces in
<code>demosurvey_page.js</code>, <code>general_comments_page.js</code>, and
<code>questionnaire_page.js</code>. All other <code>.js</code> and <code>.css</code> files are
libraries which were pulled in from outside sources.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> documented-input.xml</h3>
<div class="outline-text-3" id="text-4-4">
<p>
This is an annotated version of the input xml file which explains what each element is used for.
</p>
</div>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> resources</h3>
<div class="outline-text-3" id="text-4-5">
<p>
The resources directory contains a number of non-code files used by
the application.
</p>
</div>

<div id="outline-container-sec-4-5-1" class="outline-4">
<h4 id="sec-4-5-1"><span class="section-number-4">4.5.1</span> policies.txt</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
A text file of the format:
</p>
<div class="org-src-container">

<pre class="src src-txt">Policy Name|filename.pdf
Policy Name2|filename2.pdf
</pre>
</div>
<p>
Where <code>Policy Name</code> is the title which will be given to the policy in
the application, and filename.pdf is the name of the file to take
from the <code>policies</code> directory (also under <code>resources</code>).
</p>

<p>
Each user has a list of the titles associated with them. A persistent
mapping from title to filename is stored in the "config" collection in
the database. When you change a title, a new entry gets added to the
mapping with the new title and the old filename - The old title will
continue working as it did before. If you change the filename
associated with a particular title, then any user who has that title
will now be served the new filename.
</p>

<p>
To be more succint:
Changing a title adds to the title:filename mapping, whereas changing
a filename changes the mapping.
</p>
</div>
</div>

<div id="outline-container-sec-4-5-2" class="outline-4">
<h4 id="sec-4-5-2"><span class="section-number-4">4.5.2</span> polices</h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
Contains policy pdfs, which are specified in policies.txt.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Input XML file</h3>
<div class="outline-text-3" id="text-4-6">
<p>
The input xml file (which, at the time of this writing, is set to
<code>pp_test.xml</code> in <code>policy_study/config.py</code>. See <code>documented-input.xml</code>
for more information.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Moving to production</h2>
