ps-aug19-2017/documentation.org
** Installing and configuring production application
Adapted from:
http://vladikk.com/2013/09/12/serving-flask-with-nginx-on-ubuntu/


Create production directory, and chown to yourself for setup convenience
#+begin_src bash
sudo mkdir /var/www/policy_study
sudo chown -R mij:mij policy_study
#+end_src

Create the python virtualenv and point it to a python 2.7.8 executable
you'll have to make sure this python executable is accessible by
www-data or whatever user you end up using for uwsgi.
#+begin_src bash
cd /var/www/policy_study
virtualenv -p /home/mij/usr/bin/python2.7 venv
source venv/bin/activate
#+end_src

Clone the repository
#+begin_src bash
git clone mij@localhost:/home/mij/opt/git/policy_study.git .
#+end_src


Install dependencies
#+begin_src bash
python setup.py install
#+end_src

Install MongoDB - consult documentation for your operating
system. Ubuntu docs are found here:
http://docs.mongodb.org/manual/tutorial/install-mongodb-on-ubuntu/.
For Debian based systems, something like the following will generally
work.
#+begin_src bash
sudo apt-get -y install mongodb-org
#+end_src
If Mongo does not start automatically, you may have to start it before
you'll be able to run the application. Consult the Mongo documentation
for the proper way to start it on your system.


Edit =policy_study/config.py= to point to the correct resource files and
database.  I added the =BASE_DIR= line and modified the other 4 - leave
the rest of the file the same
#+begin_src python
BASE_DIR="/var/www/policy_study/"
DBNAME = "production_policydb"
POLICY_DIR = BASE_DIR + "resources/policies/"
POLICY_FILE = BASE_DIR + "resources/policies.txt"
INPUT_FILE = BASE_DIR + "resources/pp_test.xml"
#+end_src

Install uwsgi
#+begin_src bash
sudo apt-get install build-essential python-dev
pip install uwsgi
#+end_src

Install nginx
#+BEGIN_SRC bash
sudo add-apt-repository ppa:nginx/stable
sudo apt-get update && sudo apt-get upgrade
sudo apt-get install nginx
sudo /etc/init.d/nginx start
#+END_SRC

Configure nginx
#+begin_src bash
sudo rm /etc/nginx/sites-enabled/default
#+end_src

Create nginx conf file =/etc/nginx/conf.d/policy_study_nginx.conf=
#+begin_src conf
    server {
        listen      80;
        server_name localhost;
        charset     utf-8;
        client_max_body_size 75M;

        location / { try_files $uri @policy_study; }
        location @policy_study {
            include uwsgi_params;
            uwsgi_pass unix:/var/www/policy_study/policy_study_uwsgi.sock;
        }
    }
#+end_src


Create uwsgi ini file =/var/www/policy_study_uwsgi.ini=
#+begin_src conf
    [uwsgi]
    #application's base folder
    base = /var/www/policy_study

    #python module to import
    app = policy_study
    module = %(app)

    home = %(base)/venv
    pythonpath = %(base)

    #socket file's location
    socket = /var/www/policy_study/%n.sock

    #permissions for the socket file
    chmod-socket    = 644

    #the variable that holds a flask application inside the module imported at line #6
    callable = app

    #location of log files
    logto = /var/log/uwsgi/%n.log
#+end_src


Create and chown uwsgi log directory.
#+begin_src bash
sudo mkdir -p /var/log/uwsgi
sudo chown -R mij:mij /var/log/uwsgi
#+end_src


Configure uwsgi to run as a background processes using uwsgi emperor.
Edit uwsgi emperor conf =/etc/init/uwsgi.conf=
#+begin_src conf
    description "uWSGI"
    start on runlevel [2345]
    stop on runlevel [06]
    respawn
    env UWSGI=/var/www/policy_study/venv/bin/uwsgi
    env LOGTO=/var/log/uwsgi/emperor.log
    exec $UWSGI --master --emperor /etc/uwsgi/vassals --die-on-term --uid www-data --gid www-data --logto $LOGTO
#+end_src

Finish configuring emperor
#+begin_src bash
sudo mkdir /etc/uwsgi && sudo mkdir /etc/uwsgi/vassals
sudo ln -s /var/www/policy_study/policy_study_uwsgi.ini /etc/uwsgi/vassals
sudo chown -R www-data:www-data /var/www/policy_study
#+end_src

Start it up
#+begin_src bash
sudo start uwsgi
#+end_src

** Updating Production Code Base
*** Pull down the code
#+begin_src bash
cd /var/www/policy_study
sudo git pull
#+end_src

If you encounter problems at this step (merge conflicts, "you must
commit your changes", that sort of thing), it is probably because of
the changes made to config.py (see the install instructions). You can
do =git status= and =git diff= to see what your changes are, then:
#+begin_src bash
git stash
git pull
# and optionally
git stash apply
# or you can just edit config.py and add your changes back in
#+end_src


*** It may be necessary to restart uwsgi - depending on the code change
#+begin_src bash
sudo stop uwsgi
sudo start uwsgi
#+end_src
* Running Multiple Instances for Testing purposes
You can run multiple instance of the policy study (with different input files, and data stores) simultaneously.
** Instructions
*** Check out a fresh copy of the codebase.

*** Edit runserver.py
Replace the line
#+begin_src python
app.run(debug=True, host='0.0.0.0')
#+end_src
with a line like:
#+begin_src python
app.run(debug=True, host='0.0.0.0', port=5001)
#+end_src

You can replace 5001 with anything from 1000 to 65536, as long as
it doesn't conflict with an already running service. If the server
fails to start, try changing the number.

*** Edit =policy_study/config.py=
Replace the line
#+begin_src python
DBNAME = "policydb"
#+end_src
with a line like:
#+begin_src python
DBNAME = "mickyTestingSection2"
#+end_src

Once again, with each further instance, you just have to keep changing to a different (unique) name.

*** Start it up as usual

Just remember to navigate to the appropriate instance - if you were
going to http://policyserver.nist.gov:5000 before, now you need to go
to http://policyserver.nist.gov:5001
