ps-aug19-2017/documentation.html
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Installing and configuring production application</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Adapted from:
<a href="http://vladikk.com/2013/09/12/serving-flask-with-nginx-on-ubuntu/">http://vladikk.com/2013/09/12/serving-flask-with-nginx-on-ubuntu/</a>
</p>


<p>
Create production directory, and chown to yourself for setup convenience
</p>
<div class="org-src-container">

<pre class="src src-bash">sudo mkdir /var/www/policy_study
sudo chown -R mij:mij policy_study
</pre>
</div>

<p>
Create the python virtualenv and point it to a python 2.7.8 executable
you'll have to make sure this python executable is accessible by
www-data or whatever user you end up using for uwsgi.
</p>
<div class="org-src-container">

<pre class="src src-bash">cd /var/www/policy_study
virtualenv -p /home/mij/usr/bin/python2.7 venv
source venv/bin/activate
</pre>
</div>

<p>
Clone the repository
</p>
<div class="org-src-container">

<pre class="src src-bash">git clone mij@localhost:/home/mij/opt/git/policy_study.git .
</pre>
</div>


<p>
Install dependencies
</p>
<div class="org-src-container">

<pre class="src src-bash">python setup.py install
</pre>
</div>

<p>
Install MongoDB - consult documentation for your operating
system. Ubuntu docs are found here:
<a href="http://docs.mongodb.org/manual/tutorial/install-mongodb-on-ubuntu/">http://docs.mongodb.org/manual/tutorial/install-mongodb-on-ubuntu/</a>.
For Debian based systems, something like the following will generally
work.
</p>
<div class="org-src-container">

<pre class="src src-bash">sudo apt-get -y install mongodb-org
</pre>
</div>
<p>
If Mongo does not start automatically, you may have to start it before
you'll be able to run the application. Consult the Mongo documentation
for the proper way to start it on your system.
</p>


<p>
Edit <code>policy_study/config.py</code> to point to the correct resource files and
database.  I added the <code>BASE_DIR</code> line and modified the other 4 - leave
the rest of the file the same
</p>
<div class="org-src-container">

<pre class="src src-python">BASE_DIR="/var/www/policy_study/"
DBNAME = "production_policydb"
POLICY_DIR = BASE_DIR + "resources/policies/"
POLICY_FILE = BASE_DIR + "resources/policies.txt"
INPUT_FILE = BASE_DIR + "resources/pp_test.xml"
</pre>
</div>

<p>
Install uwsgi
</p>
<div class="org-src-container">

<pre class="src src-bash">sudo apt-get install build-essential python-dev
pip install uwsgi
</pre>
</div>

<p>
Install nginx
</p>
<div class="org-src-container">

<pre class="src src-bash">sudo add-apt-repository ppa:nginx/stable
sudo apt-get update &amp;&amp; sudo apt-get upgrade
sudo apt-get install nginx
sudo /etc/init.d/nginx start
</pre>
</div>

<p>
Configure nginx
</p>
<div class="org-src-container">

<pre class="src src-bash">sudo rm /etc/nginx/sites-enabled/default
</pre>
</div>

<p>
Create nginx conf file <code>/etc/nginx/conf.d/policy_study_nginx.conf</code>
</p>
<div class="org-src-container">

<pre class="src src-conf">server {
	listen      80;
	server_name localhost;
	charset     utf-8;
	client_max_body_size 75M;

	location / { try_files $uri @policy_study; }
	location @policy_study {
		include uwsgi_params;
		uwsgi_pass unix:/var/www/policy_study/policy_study_uwsgi.sock;
	}
}
</pre>
</div>


<p>
Create uwsgi ini file <code>/var/www/policy_study_uwsgi.ini</code>
</p>
<div class="org-src-container">

<pre class="src src-conf">[uwsgi]
#application's base folder
base = /var/www/policy_study

#python module to import
app = policy_study
module = %(app)

home = %(base)/venv
pythonpath = %(base)

#socket file's location
socket = /var/www/policy_study/%n.sock

#permissions for the socket file
chmod-socket    = 644

#the variable that holds a flask application inside the module imported at line #6
callable = app

#location of log files
logto = /var/log/uwsgi/%n.log
</pre>
</div>


<p>
Create and chown uwsgi log directory.
</p>
<div class="org-src-container">

<pre class="src src-bash">sudo mkdir -p /var/log/uwsgi
sudo chown -R mij:mij /var/log/uwsgi
</pre>
</div>


<p>
Configure uwsgi to run as a background processes using uwsgi emperor.
Edit uwsgi emperor conf <code>/etc/init/uwsgi.conf</code>
</p>
<div class="org-src-container">

<pre class="src src-conf">description "uWSGI"
start on runlevel [2345]
stop on runlevel [06]
respawn
env UWSGI=/var/www/policy_study/venv/bin/uwsgi
env LOGTO=/var/log/uwsgi/emperor.log
exec $UWSGI --master --emperor /etc/uwsgi/vassals --die-on-term --uid www-data --gid www-data --logto $LOGTO
</pre>
</div>

<p>
Finish configuring emperor
</p>
<div class="org-src-container">

<pre class="src src-bash">sudo mkdir /etc/uwsgi &amp;&amp; sudo mkdir /etc/uwsgi/vassals
sudo ln -s /var/www/policy_study/policy_study_uwsgi.ini /etc/uwsgi/vassals
sudo chown -R www-data:www-data /var/www/policy_study
</pre>
</div>

<p>
Start it up
</p>
<div class="org-src-container">

<pre class="src src-bash">sudo start uwsgi
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Updating Production Code Base</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> Pull down the code</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">

<pre class="src src-bash">cd /var/www/policy_study
sudo git pull
</pre>
</div>

<p>
If you encounter problems at this step (merge conflicts, "you must
commit your changes", that sort of thing), it is probably because of
the changes made to config.py (see the install instructions). You can
do <code>git status</code> and <code>git diff</code> to see what your changes are, then:
</p>
<div class="org-src-container">

<pre class="src src-bash">git stash
git pull
# and optionally
git stash apply
# or you can just edit config.py and add your changes back in
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2"><span class="section-number-4">5.2.2</span> It may be necessary to restart uwsgi - depending on the code change</h4>
<div class="outline-text-4" id="text-5-2-2">
<div class="org-src-container">

<pre class="src src-bash">sudo stop uwsgi
sudo start uwsgi
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Running Multiple Instances for Testing purposes</h2>
<div class="outline-text-2" id="text-6">
<p>
You can run multiple instance of the policy study (with different input files, and data stores) simultaneously.
</p>
</div>
<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Instructions</h3>
<div class="outline-text-3" id="text-6-1">
</div><div id="outline-container-sec-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> Check out a fresh copy of the codebase.</h4>
</div>

<div id="outline-container-sec-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> Edit runserver.py</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
Replace the line
</p>
<div class="org-src-container">

<pre class="src src-python">app.run(debug=True, host='0.0.0.0')
</pre>
</div>
<p>
with a line like:
</p>
<div class="org-src-container">

<pre class="src src-python">app.run(debug=True, host='0.0.0.0', port=5001)
</pre>
</div>

<p>
You can replace 5001 with anything from 1000 to 65536, as long as
it doesn't conflict with an already running service. If the server
fails to start, try changing the number.
</p>
</div>
</div>

<div id="outline-container-sec-6-1-3" class="outline-4">
<h4 id="sec-6-1-3"><span class="section-number-4">6.1.3</span> Edit <code>policy_study/config.py</code></h4>
<div class="outline-text-4" id="text-6-1-3">
<p>
Replace the line
</p>
<div class="org-src-container">

<pre class="src src-python">DBNAME = "policydb"
</pre>
</div>
<p>
with a line like:
</p>
<div class="org-src-container">

<pre class="src src-python">DBNAME = "mickyTestingSection2"
</pre>
</div>

<p>
Once again, with each further instance, you just have to keep changing to a different (unique) name.
</p>
</div>
</div>

<div id="outline-container-sec-6-1-4" class="outline-4">
<h4 id="sec-6-1-4"><span class="section-number-4">6.1.4</span> Start it up as usual</h4>
<div class="outline-text-4" id="text-6-1-4">
<p>
Just remember to navigate to the appropriate instance - if you were
going to <a href="http://policyserver.nist.gov:5000">http://policyserver.nist.gov:5000</a> before, now you need to go
to <a href="http://policyserver.nist.gov:5001">http://policyserver.nist.gov:5001</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matthew Jaffee</p>
<p class="date">Created: 2014-12-02 Tue 17:54</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
